dan-c-underwood.arm
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mhutchie.git-graph
ms-vscode.cpptools-themes
ms-vscode.vscode-embedded-tools
ms-vscode.vscode-serial-monitor
stmicroelectronics.stm32cube-color-theme
trond-snekvik.gnu-mapfiles
zixuanwang.linkerscript
platformio.platformio-ide
xaver.clang-format
twxs.cmake
lvgl.lvgl-editor
qiaojie.binary-viewer
pkief.material-icon-theme
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
ms-vscode-remote.remote-containers
ms-vscode.cpptools-extension-pack
eamodio.gitlens
anthropic.claude-code
ms-vscode.cpptools
