trond-snekvik.gnu-mapfiles
dan-c-underwood.arm
mcu-debug.debug-tracker-vscode
marus25.cortex-debug
ms-vscode.cpptools-themes
zixuanwang.linkerscript
mhutchie.git-graph
ms-vscode.vscode-serial-monitor
ms-vscode.vscode-embedded-tools
eclipse-cdt.serial-monitor
eclipse-cdt.memory-inspector
stmicroelectronics.stm32cube-color-theme
pkief.material-icon-theme
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
stmicroelectronics.stm32cube-ide-rtos
stmicroelectronics.stm32-vscode-extension
stmicroelectronics.stm32cube-ide-clangd
stmicroelectronics.stm32cube-ide-project-manager
stmicroelectronics.stm32cube-ide-debug-jlink-gdbserver
stmicroelectronics.stm32cube-ide-registers
stmicroelectronics.stm32cube-ide-build-analyzer
stmicroelectronics.stm32cube-ide-build-cmake
stmicroelectronics.stm32cube-ide-bundles-manager
stmicroelectronics.stm32cube-ide-debug-core
stmicroelectronics.stm32cube-ide-core
stmicroelectronics.stm32cube-ide-debug-stlink-gdbserver
stmicroelectronics.stm32cube-ide-debug-generic-gdbserver
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools-extension-pack
anthropic.claude-code
ms-vscode.cpptools
